# GetWidth Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CompoundStructure..::..GetWidth Method
CompoundStructure Class See Also
---
The width implied by this compound structure.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double GetWidth()
```

Visual Basic
---
```text
Public Function GetWidth As Double
```

Visual C++
---
```text
public:
double GetWidth()
```

# ### Return Value
The width of a host object with this compound structure.
# Remarks
If the structure is not vertically compound, then this is simply the sum of all layers' widths. If the structure is vertically compound, this is the width of the rectangular grid stored in the vertically compound structure. The presence of a layer with variable width has no effect on the value returned by this method. The value returned assumes that all layers have their specified width.
# See Also
CompoundStructure Class
GetWidth Overload
Autodesk.Revit.DB Namespace